tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"

brew "autoconf"
brew "automake"
brew "ca-certificates"
brew "glib"
brew "cliclick"
brew "coreutils"
brew "duti"
brew "openssl@3"
brew "gnutls"
brew "gh"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "pkgconf"
brew "shared-mime-info"
brew "python@3.12"
brew "libtool"
brew "libyaml"
brew "libpq"
brew "zlib"
brew "mysql", restart_service: :changed
brew "neonctl"
brew "neovim"
brew "tmux"
brew "overmind"
brew "pipx"
brew "postgresql@14", restart_service: :changed
brew "postgresql@16"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "tailscale", restart_service: :changed
brew "tree"
brew "vips"
brew "yarn"
brew "zsh-syntax-highlighting"
