anthropic.claude-code
astro-build.astro-vscode
databricks.neon-local-connect
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.code-runner
geequlim.godot-tools
github.copilot-chat
github.github-vscode-theme
groksrc.ruby
hoovercj.ruby-linter
kaiwood.endwise
ldrner.rspec-snippets-vscode
mechatroner.rainbow-csv
miguel-savignano.ruby-symbols
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.vscode-typescript-next
shopify.ruby-lsp
svelte.svelte-vscode
thadeu.vscode-run-rspec-file
twxs.cmake
unthrottled.doki-theme
vayan.haml
vortizhe.simple-ruby-erb
vscodevim.vim
